Revit 2027 API
UnitFormatUtils.TryParse(Units, ForgeTypeId, String, Double, String) Method
 Parses a formatted string into a number with units if possible.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool TryParse(
	Units units,
	ForgeTypeId specTypeId,
	string stringToParse,
	out double value,
	out string message
)
Public Shared Function TryParse (
	units As Units,
	specTypeId As ForgeTypeId,
	stringToParse As String,
	<OutAttribute> ByRef value As Double,
	<OutAttribute> ByRef message As String
) As Boolean
public:
static bool TryParse(
	Units^ units,
	ForgeTypeId^ specTypeId,
	String^ stringToParse,
	[OutAttribute] double% value,
	[OutAttribute] String^% message
)
static member TryParse :
        units : Units *
        specTypeId : ForgeTypeId *
        stringToParse : string *
        value : float byref *
        message : string byref -> bool
Parameters
units Units
 The units formatting settings, typically obtained from Document.GetUnits().
specTypeId ForgeTypeId
 Identifier of the target spec for the value.
stringToParse String
 The string to parse.
value Double
 The parsed value. Ignore this value if the function returns false.
message String
 A localized message that, if the parsing fails, explains the reason for failure.
Return Value
Boolean
 True if the string can be parsed, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId).
ArgumentNullException |  A non-optional argument was null
See Also
Reference
UnitFormatUtils Class
TryParse Overload
Autodesk.Revit.DB Namespace